GitGriever/Game/Keil_v5/ARM/Boards/Nuvoton/NuTiny-EVB_NUC122/Src/Driver/DrvUART.c
    /*-----------------------------------------------------------------------------------------------------*/
    /* Check the supplied nember of trigger level bytes                                                    */
    /*-----------------------------------------------------------------------------------------------------*/
    else if ((sParam->u8cRxTriggerLevel != DRVUART_FIFO_1BYTES) &&
             (sParam->u8cRxTriggerLevel != DRVUART_FIFO_4BYTES) &&
             (sParam->u8cRxTriggerLevel != DRVUART_FIFO_8BYTES) &&
             (sParam->u8cRxTriggerLevel != DRVUART_FIFO_14BYTES)&&
             (sParam->u8cRxTriggerLevel != DRVUART_FIFO_30BYTES)&&
             (sParam->u8cRxTriggerLevel != DRVUART_FIFO_46BYTES)&&
             (sParam->u8cRxTriggerLevel != DRVUART_FIFO_62BYTES))
    {
        return E_DRVUART_ERR_TRIGGERLEVEL_INVALID;       
    }               

    if(u32Port == UART_PORT0)
    {
        /* Enable UART clock */
        SYSCLK->APBCLK.UART0_EN = 1;
        /* Reset IP */
        SYS->IPRSTC2.UART0_RST = 1;
        SYS->IPRSTC2.UART0_RST = 0;
    }
    else if(u32Port == UART_PORT1)
    {
        /* Enable UART clock */
        SYSCLK->APBCLK.UART1_EN = 1;
        /* Reset IP */
        SYS->IPRSTC2.UART1_RST = 1;
        SYS->IPRSTC2.UART1_RST = 0;
    }
    
    tUART = (UART_T *)((uint32_t)UART0 + u32Port); 


    /* Tx FIFO Reset & Rx FIFO Reset & FIFO Mode Enable */
    tUART->FCR.TFR =1;
    tUART->FCR.RFR =1;

    /* Set Rx Trigger Level */
    tUART->FCR.RFITL = sParam->u8cRxTriggerLevel;  
    
    /* Set Parity & Data bits & Stop bits */
    tUART->LCR.SPE  =((sParam->u8cParity)&0x4)?1:0;
    tUART->LCR.EPE  =((sParam->u8cParity)&0x2)?1:0;
    tUART->LCR.PBE  =((sParam->u8cParity)&0x1)?1:0;
        
    tUART->LCR.WLS  =sParam->u8cDataBits;
    tUART->LCR.NSB  =sParam->u8cStopBits;
        
    /* Set Time-Out */
    tUART->TOR.TOIC =sParam->u8TimeOut;

    /* Auto-select clock source */
    if(SYSCLK->PWRCON.XTL12M_EN)
        SYSCLK->CLKSEL1.UART_S = 0;
    else
    {
        if(SYSCLK->PLLCON.PD==0)
            SYSCLK->CLKSEL1.UART_S = 1;
        else
            if(SYSCLK->PWRCON.OSC22M_EN)
                SYSCLK->CLKSEL1.UART_S = 3;
            else
                return E_DRVUART_ERR_OPEN;
    }
    /* Set BaudRate */
    BaudRateCalculator(GetUartClock(), sParam->u32BaudRate, u32Port);

    return E_SUCCESS;
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function:        DrvUART_Close                                                                          */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*                  u32Port      -[in] UART Channel:  UART_PORT0 / UART_PORT1                              */
/* RETURN                                                                                                  */
/*                  None                                                                                   */
/* Description:                                                                                            */
/*                  The function is used to disable UART clock, disable ISR and clear callback             */
/*                  function pointer after checking the TX empty.                                          */
/*---------------------------------------------------------------------------------------------------------*/

void DrvUART_Close(E_UART_PORT u32Port)
{
    if(u32Port == UART_PORT1)   
    {
        while(!UART1->FSR.TE_FLAG);
        SYSCLK->APBCLK.UART1_EN = 0;
        g_pfnUART1callback = NULL;
        NVIC_DisableIRQ (UART1_IRQn); 
    }
    else
    {
        while(!UART0->FSR.TE_FLAG);
        SYSCLK->APBCLK.UART0_EN = 0;
        g_pfnUART0callback = NULL;
        NVIC_DisableIRQ(UART0_IRQn);      
    }
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_EnableInt                                                                         */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               u32Port          -[in] UART Channel:  UART_PORT0 / UART_PORT1                             */
/*               u32InterruptFlag -[in] DRVUART_LININT/DRVUART_WAKEUPINT/DRVUART_BUFERRINT/DRVUART_RLSINT  */
/*                                      DRVUART_MOSINT/DRVUART_THREINT/DRVUART_RDAINT/DRVUART_TOUTINT      */
/*               pfncallback      -[in] A function pointer for callback function                           */
/* Returns:                                                                                                */
/*               None                                                                                      */
/* Description:                                                                                            */
/*               The function is used to enable specified UART interrupt, install the callback             */
/*               function and enable NVIC UART IRQ                                                         */
/*---------------------------------------------------------------------------------------------------------*/
void
DrvUART_EnableInt(
    E_UART_PORT   u32Port,
    uint32_t  u32InterruptFlag,
    PFN_DRVUART_CALLBACK pfncallback
)
{
    UART_T * tUART;
    
    tUART = (UART_T *)((uint32_t)UART0 + u32Port); 

    tUART->IER.RDA_IEN      =(u32InterruptFlag & DRVUART_RDAINT)?1:0 ;
    tUART->IER.THRE_IEN     =(u32InterruptFlag & DRVUART_THREINT)?1:0;
    tUART->IER.RLS_IEN      =(u32InterruptFlag & DRVUART_RLSINT)?1:0;
    tUART->IER.MODEM_IEN    =(u32InterruptFlag & DRVUART_MOSINT)?1:0;
        
    tUART->IER.TIME_OUT_EN  =(u32InterruptFlag & DRVUART_TOUTINT)?1:0;      /* Time-out count enable */
    tUART->IER.RTO_IEN      =(u32InterruptFlag & DRVUART_TOUTINT)?1:0;      /* Time-out INT enable */

