GitGriever/Game/Keil_v5/ARM/Boards/Nuvoton/NuTiny-EVB_NUC122/Src/Driver/DrvUART.c
    tUART->IER.BUF_ERR_IEN  =(u32InterruptFlag & DRVUART_BUFERRINT)?1:0;
    tUART->IER.WAKE_EN      =(u32InterruptFlag & DRVUART_WAKEUPINT)?1:0;
  

    if(u32Port == UART_PORT0)                                               /* Install Callback function */
    {
        g_pfnUART0callback = pfncallback;
        NVIC_SetPriority (UART0_IRQn, (1<<__NVIC_PRIO_BITS) - 2);        
        NVIC_EnableIRQ(UART0_IRQn); 
        
    }
    else //if(u32Port == UART_PORT1)                                          /* Install Callback function */
    {
        g_pfnUART1callback = pfncallback;
        NVIC_SetPriority (UART1_IRQn, (1<<__NVIC_PRIO_BITS) - 2);
        NVIC_EnableIRQ(UART1_IRQn); 
        
    }

}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_DisableInt                                                                        */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               u32Port          -[in] UART Channel:  UART_PORT0 / UART_PORT1                             */
/*               u32InterruptFlag -[in] DRVUART_LININT/DRVUART_WAKEUPINT/DRVUART_BUFERRINT/DRVUART_RLSINT  */
/*                                      DRVUART_MOSINT/DRVUART_THREINT/DRVUART_RDAINT/DRVUART_TOUTINT      */
/* Returns:                                                                                                */
/*               None                                                                                      */
/* Description:                                                                                            */
/*               The function is used to disable UART specified interrupt, uninstall the call back         */
/*               function and disable NVIC UART IRQ                                                        */
/*---------------------------------------------------------------------------------------------------------*/
void DrvUART_DisableInt(E_UART_PORT u32Port,uint32_t u32InterruptFlag)
{
    if(u32Port == UART_PORT0)              
    {
        outpw(&UART0->IER + u32Port,inpw(&UART0->IER + u32Port) &~u32InterruptFlag);       /* Disable INT  */
    }
    
    if(u32InterruptFlag & DRVUART_TOUTINT)                                       /* Disable Counter Enable */
    {
        if(u32Port == UART_PORT0)
            UART0->IER.RTO_IEN = 0;
        else if(u32Port == UART_PORT1)
            UART1->IER.RTO_IEN = 0;
            
    }
    
    switch (u32Port)                                                 /* Disable Callback function and NVIC */
    {
        case UART_PORT0:
            g_pfnUART0callback = NULL;
            NVIC_DisableIRQ(UART0_IRQn);   
            break;

        case UART_PORT1:
            g_pfnUART1callback = NULL;
            NVIC_DisableIRQ(UART1_IRQn);    
            break;
        
        default:
            break;
    }

}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_ClearIntFlag                                                                      */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               u32Port              -[in]   UART Channel:  UART_PORT0 / UART_PORT1                       */
/*               u32InterruptFlag     -[in]   DRVUART_MOSINT/DRVUART_RLSINT/DRVUART_THREINT                */
/*                                            DRVUART_RDAINT/DRVUART_TOUTINT                               */
/* Returns:                                                                                                */
/*               E_SUCCESS      Successful                                                                 */
/* Description:                                                                                            */
/*               The function is used to clear UART specified interrupt flag                               */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t DrvUART_ClearIntFlag(E_UART_PORT   u32Port,uint32_t u32InterruptFlag)
{
    UART_T * tUART;

    tUART = (UART_T *)((uint32_t)UART0 + u32Port); 

    if((u32InterruptFlag & DRVUART_RDAINT) == DRVUART_RDAINT)               /* clear Rx read Interrupt */      
        tUART->DATA;

    if((u32InterruptFlag & DRVUART_THREINT) == DRVUART_THREINT)             /* clear Tx empty Interrupt */     
    {
        tUART->DATA =0;                                                     /* Write Data to TX FIFO to clear INT Flag */
    }   

    if((u32InterruptFlag & DRVUART_RLSINT)  == DRVUART_RLSINT)              /* clear Receive Line Status Interrupt */      
    {
        tUART->FSR.BIF = 1;
        tUART->FSR.FEF = 1;
        tUART->FSR.PEF = 1;
    }

    if((u32InterruptFlag & DRVUART_MOSINT)  == DRVUART_MOSINT)              /* clear Modem Interrupt */    
        tUART->MSR.DCTSF = 1;

    if((u32InterruptFlag & DRVUART_TOUTINT) == DRVUART_TOUTINT)             /* clear Time-out Interrupt */     
        tUART->DATA;

    if((u32InterruptFlag & DRVUART_BUFERRINT)  == DRVUART_BUFERRINT)        /* clear Buffer ErrorInterrupt */      
    {
        tUART->FSR.TX_OVER_IF = 1;
        tUART->FSR.RX_OVER_IF = 1;
    }
    return E_SUCCESS;
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_GetIntStatus                                                                      */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               u32Port              -[in]   UART Channel:  UART_PORT0 / UART_PORT1                       */
/*               u32InterruptFlag     -[in]   DRVUART_MOSINT / DRVUART_RLSINT / DRVUART_THREINT            */
/*                                            DRVUART_RDAINT/DRVUART_TOUTINT                               */
/* Returns:                                                                                                */
/*               0: The specified interrupt is not happened.                                               */
/*               1: The specified interrupt is happened.                                                   */
/*               E_DRVUART_ARGUMENT: Error Parameter                                                       */
/* Description:                                                                                            */
/*               The function is used to get the interrupt status                                          */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvUART_GetIntStatus(E_UART_PORT u32Port,uint32_t u32InterruptFlag)
{

    UART_T * tUART;

    tUART = (UART_T *)((uint32_t)UART0 + u32Port); 

    
    switch(u32InterruptFlag)
    {
        case DRVUART_MOSINT:                        /* MODEM Status Interrupt */
                return tUART->ISR.MODEM_INT;
        
        case DRVUART_RLSINT:                        /* Receive Line Status Interrupt */
                return tUART->ISR.RLS_INT;

        case DRVUART_THREINT:                       /* Transmit Holding Register Empty Interrupt */
                return tUART->ISR.THRE_INT;

        case DRVUART_RDAINT:                        /* Receive Data Available Interrupt */
                return tUART->ISR.RDA_INT;

        case DRVUART_TOUTINT:                       /* Time-out Interrupt */
                return tUART->ISR.TOUT_INT;

        case DRVUART_BUFERRINT:                     /* Buffer Error Interrupt */
                return tUART->ISR.BUF_ERR_INT;

        default:
            return E_DRVUART_ARGUMENT;
    }
    
