GitGriever/Game/Keil_v5/ARM/Boards/Nuvoton/NuTiny-EVB_NUC122/Src/Driver/DrvUART.c
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_GetCTS                                                                            */
/*                                                                                                         */
/* Parameter:                                                                                              */   
/*               u32Port              -[in]   UART Channel:  UART_PORT0 / UART_PORT1                       */
/*               pu8CTSValue          -[out]   Buffer to store the CTS Value                               */
/*                                             return current CTS pin state                                */
/*               pu8CTSChangeState    -[out]   Buffer to store the CTS Change State                        */
/*                                             return CTS pin status is changed or not 1:Changed 0:Not yet */
/* Returns:                                                                                                */
/*               None                                                                                      */
/* Description:                                                                                            */
/*               The function is used to get CTS pin value and detect CTS change state                     */
/*---------------------------------------------------------------------------------------------------------*/
void DrvUART_GetCTS(E_UART_PORT u32Port,uint8_t *pu8CTSValue,   uint8_t *pu8CTSChangeState)
{
    UART_T * tUART;

    tUART = (UART_T *)((uint32_t)UART0 + u32Port);  

    *pu8CTSValue        = tUART->MSR.CTS_ST;
    *pu8CTSChangeState  = tUART->MSR.DCTSF;
}   

 
/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_Read                                                                              */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               u32Port              -[in]   UART Channel:  UART_PORT0 / UART_PORT1                       */
/*               pu8RxBuf             -[in]   Specify the buffer to receive the data of receive FIFO       */
/*               u32ReadBytes         -[in]   Specify the bytes number of data.                            */
/* Returns:                                                                                                */
/*               E_SUCCESS                                                                                 */
/* Description:                                                                                            */
/*               The function is used to read Rx data from RX FIFO and the data will be stored in pu8RxBuf */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvUART_Read(E_UART_PORT    u32Port,uint8_t *pu8RxBuf, uint32_t u32ReadBytes)
{
    uint32_t  u32Count, u32delayno;

    UART_T * tUART;

    tUART = (UART_T *)((uint32_t)UART0 + u32Port);  

    for (u32Count=0; u32Count < u32ReadBytes; u32Count++)
    {
         u32delayno = 0;
         while (tUART->FSR.RX_EMPTY ==1)                        /* Check RX empty => failed */     
         {
            u32delayno++;        
            if ( u32delayno >= 0x40000000 )        
                return E_DRVUART_ERR_TIMEOUT;               
         }
         pu8RxBuf[u32Count] = tUART->DATA;                      /* Get Data from UART RX  */
    }

    return E_SUCCESS;
    
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_Write                                                                             */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               u32Port              -[in]   UART Channel:  UART_PORT0 / UART_PORT1                       */
/*               pu8RxBuf             -[in]   Specify the buffer to send the data to transmission FIFO.    */
/*               u32ReadBytes         -[in]   Specify the byte number of data.                             */
/* Returns:                                                                                                */
/*               E_SUCCESS                                                                                 */
/*                                                                                                         */
/* Description:                                                                                            */
/*               TThe function is to write data to TX buffer to transmit data by UART                      */
/* Note:                                                                                                   */
/*               In IrDA Mode, the BAUD RATE configure MUST to use MODE # 0                                */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvUART_Write(E_UART_PORT   u32Port,uint8_t *pu8TxBuf,  uint32_t u32WriteBytes)
{
    uint32_t  u32Count, u32delayno;

    UART_T * tUART;

    tUART = (UART_T *)((uint32_t)UART0 + u32Port);  

    for (u32Count=0; u32Count<u32WriteBytes; u32Count++)
    {
       u32delayno = 0;
       while (tUART->FSR.TE_FLAG !=1)                               /* Wait Tx empty and Time-out manner */
       {
            u32delayno++;
            if ( u32delayno >= 0x40000000 )             
               return E_DRVUART_ERR_TIMEOUT;               
                   
