GitGriever/Game/Keil_v5/ARM/Boards/Nuvoton/NuTiny-EVB_NUC122/Src/Driver/DrvUART.c
       }
       tUART->DATA = pu8TxBuf[u32Count];                        /* Send UART Data from buffer */
    }

    return E_SUCCESS;
  
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_SetFnIRCR                                                                         */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               u32Port              -[in]   UART Channel:  UART_PORT0 / UART_PORT1                       */
/*               STR_IRCR_T           -[in]   Ther stucture of IRCR                                        */
/*                                            It includes of                                               */
/*                                               u8cTXSelect: 1: Enable Irda transmit function.(TX mode)   */
/*                                                            0: Disable Irda transmit function.(RX mode)  */
/*                                               u8cInvTX: Inverse TX signal                               */
/*                                               u8cInvRX: Inverse RX signal                               */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               E_SUCCESS                                                                                 */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is used to configure IRDA relative settings.                                 */
/*               It consists of TX or RX mode and Inverse TX or RX signals.                                */
/*---------------------------------------------------------------------------------------------------------*/
void DrvUART_SetFnIRDA(E_UART_PORT u32Port,STR_IRCR_T *str_IRCR )
{
    UART_T * tUART;

    tUART = (UART_T *)((uint32_t)UART0 + u32Port);  

    tUART->FUNSEL.FUN_SEL   = FUN_IRCR;                             /* Enable IrDA function and configure */
    tUART->IRCR.TX_SELECT   = (str_IRCR->u8cTXSelect) ?1:0;
    tUART->IRCR.INV_TX      = str_IRCR->u8cInvTX ;
    tUART->IRCR.INV_RX      = str_IRCR->u8cInvRX ;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_SetFnRS485                                                                        */
/*                                                                                                         */
/* Parameter:                                                                                              */
/*               u32Port              -[in]   UART Channel:  UART_PORT0 / UART_PORT1                       */
/*               STR_RS485_T          -[in]   Ther stucture of RS485                                       */
/*                                            It includes of                                               */
/*                                               u8cModeSelect: MODE_RS485_AUD / MODE_RS485_AAD            */
/*                                                              MODE_RS485_NMM                             */
/*                                               u8cAddrEnable: Enable or Disable RS-485 Address Detection */
/*                                               u8cAddrValue:  Match Address Value                        */
/*                                               u8cDelayTime:  Set transmit delay time value              */
/*                                               u8cRxDisable:  Enable or Disable receiver function        */
/* Returns:                                                                                                */
/*               None                                                                                      */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is to Set RS485 Control Register                                             */
/*---------------------------------------------------------------------------------------------------------*/
void DrvUART_SetFnRS485(E_UART_PORT u32Port,STR_RS485_T *str_RS485)
{
                     
    UART_T * tUART;

    tUART = (UART_T *)((uint32_t)UART0 + u32Port);  

    tUART->FUNSEL.FUN_SEL           = FUN_RS485;                    
    tUART->ALTCON.RS485_ADD_EN      = (str_RS485-> u8cAddrEnable) ?1:0;
    tUART->ALTCON.ADDR_MATCH        = str_RS485-> u8cAddrValue ;
    tUART->ALTCON.RS485_NMM         = (str_RS485-> u8cModeSelect & MODE_RS485_NMM)?1:0; 
    tUART->ALTCON.RS485_AAD         = (str_RS485-> u8cModeSelect & MODE_RS485_AAD)?1:0; 
    tUART->ALTCON.RS485_AUD         = (str_RS485-> u8cModeSelect & MODE_RS485_AUD)?1:0; 
    tUART->TOR.DLY                  = str_RS485-> u8cDelayTime;
    tUART->FCR.RX_DIS               = (str_RS485-> u8cRxDisable) ?1:0;
    tUART->MCR.LEV_RTS              = 0;

} 

/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvUART_GetVersion                                                                        */
/*                                                                                                         */
/* Parameter:                                                                                              */   
/*               None                                                                                      */
/* Returns:                                                                                                */
/*               Version Number                                                                            */
/* Side effects:                                                                                           */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is used to get  DrvUART Version Number                                       */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvUART_GetVersion(void)
{
    return DRVUART_VERSION_NUM;
    
}





